{
  "Class": "patch",
  "ID": "oval:com.redhat.rhsa:def:20130277",
  "Version": "642",
  "Metadata": {
    "Title": "RHSA-2013:0277: dnsmasq security, bug fix and enhancement update (Moderate)",
    "AffectedList": [
      {
        "Family": "unix",
        "Platforms": [
          "Red Hat Enterprise Linux 6"
        ]
      }
    ],
    "References": [
      {
        "Source": "RHSA",
        "RefID": "RHSA-2013:0277",
        "RefURL": "https://access.redhat.com/errata/RHSA-2013:0277"
      },
      {
        "Source": "CVE",
        "RefID": "CVE-2012-3411",
        "RefURL": "https://access.redhat.com/security/cve/CVE-2012-3411"
      }
    ],
    "Description": "The dnsmasq packages contain Dnsmasq, a lightweight DNS (Domain Name\nServer) forwarder and DHCP (Dynamic Host Configuration Protocol) server.\n\nIt was discovered that dnsmasq, when used in combination with certain\nlibvirtd configurations, could incorrectly process network packets from\nnetwork interfaces that were intended to be prohibited. A remote,\nunauthenticated attacker could exploit this flaw to cause a denial of\nservice via DNS amplification attacks. (CVE-2012-3411)\n\nIn order to fully address this issue, libvirt package users are advised to\ninstall updated libvirt packages. Refer to RHSA-2013:0276 for additional\ninformation.\n\nThis update also fixes the following bug:\n\n* Due to a regression, the lease change script was disabled. Consequently,\nthe \"dhcp-script\" option in the /etc/dnsmasq.conf configuration file did\nnot work. This update corrects the problem and the \"dhcp-script\" option now\nworks as expected. (BZ#815819)\n\nThis update also adds the following enhancements:\n\n* Prior to this update, dnsmasq did not validate that the tftp directory\ngiven actually existed and was a directory. Consequently, configuration\nerrors were not immediately reported on startup. This update improves the\ncode to validate the tftp root directory option. As a result, fault finding\nis simplified especially when dnsmasq is called by external processes such\nas libvirt. (BZ#824214)\n\n* The dnsmasq init script used an incorrect Process Identifier (PID) in the\n\"stop\", \"restart\", and \"condrestart\" commands. Consequently, if there were\nsome dnsmasq instances running besides the system one started by the init\nscript, then repeated calling of \"service dnsmasq\" with \"stop\" or \"restart\"\nwould kill all running dnsmasq instances, including ones not started with\nthe init script. The dnsmasq init script code has been corrected to obtain\nthe correct PID when calling the \"stop\", \"restart\", and \"condrestart\"\ncommands. As a result, if there are dnsmasq instances running in addition\nto the system one started by the init script, then by calling \"service\ndnsmasq\" with \"stop\" or \"restart\" only the system one is stopped or\nrestarted. (BZ#850944)\n\n* When two or more dnsmasq processes were running with DHCP enabled on one\ninterface, DHCP RELEASE packets were sometimes lost. Consequently, when two\nor more dnsmasq processes were running with DHCP enabled on one interface,\nreleasing IP addresses sometimes failed. This update sets the\nSO_BINDTODEVICE socket option on DHCP sockets if running dnsmasq with DHCP\nenabled on one interface. As a result, when two or more dnsmasq processes\nare running with DHCP enabled on one interface, they can release IP\naddresses as expected. (BZ#887156)\n\nAll users of dnsmasq are advised to upgrade to these updated packages,\nwhich fix these issues and add these enhancements.",
    "Advisory": {
      "From": "secalert@redhat.com",
      "Severity": "Moderate",
      "Rights": "Copyright 2013 Red Hat, Inc.",
      "Issued": {
        "Date": "2013-02-20"
      },
      "Updated": {
        "Date": "2013-02-21"
      },
      "Cves": [
        {
          "CveID": "CVE-2012-3411",
          "Cvss2": "5.0/AV:N/AC:L/Au:N/C:N/I:N/A:P",
          "Impact": "moderate",
          "Href": "https://access.redhat.com/security/cve/CVE-2012-3411",
          "Public": "20120709"
        }
      ],
      "Bugzilla": [
        {
          "Href": "https://bugzilla.redhat.com/833033",
          "ID": "833033"
        }
      ],
      "AffectedCpeList": [
        "cpe:/o:redhat:rhel_eus:6.3",
        "cpe:/o:redhat:rhel_eus:6.3::computenode",
        "cpe:/o:redhat:rhel_eus:6.3::server"
      ],
      "Affected": {
        "Resolution": {}
      }
    }
  },
  "Criteria": {
    "Operator": "OR",
    "Criterions": [
      {
        "Comment": "Red Hat Enterprise Linux must be installed",
        "TestRef": "oval:com.redhat.rhba:tst:20111656004"
      }
    ],
    "Criterias": [
      {
        "Operator": "AND",
        "Criterions": [
          {
            "Comment": "Red Hat Enterprise Linux 6 is installed",
            "TestRef": "oval:com.redhat.rhba:tst:20111656003"
          }
        ],
        "Criterias": [
          {
            "Operator": "OR",
            "Criterias": [
              {
                "Operator": "AND",
                "Criterions": [
                  {
                    "Comment": "dnsmasq is earlier than 0:2.48-13.el6",
                    "TestRef": "oval:com.redhat.rhsa:tst:20130277001"
                  },
                  {
                    "Comment": "dnsmasq is signed with Red Hat redhatrelease2 key",
                    "TestRef": "oval:com.redhat.rhsa:tst:20130277002"
                  }
                ]
              },
              {
                "Operator": "AND",
                "Criterions": [
                  {
                    "Comment": "dnsmasq-utils is earlier than 0:2.48-13.el6",
                    "TestRef": "oval:com.redhat.rhsa:tst:20130277003"
                  },
                  {
                    "Comment": "dnsmasq-utils is signed with Red Hat redhatrelease2 key",
                    "TestRef": "oval:com.redhat.rhsa:tst:20130277004"
                  }
                ]
              }
            ]
          }
        ]
      }
    ]
  }
}