{
  "Class": "patch",
  "ID": "oval:com.redhat.rhsa:def:20111197",
  "Version": "644",
  "Metadata": {
    "Title": "RHSA-2011:1197: libvirt security and bug fix update (Moderate)",
    "AffectedList": [
      {
        "Family": "unix",
        "Platforms": [
          "Red Hat Enterprise Linux 6"
        ]
      }
    ],
    "References": [
      {
        "Source": "RHSA",
        "RefID": "RHSA-2011:1197",
        "RefURL": "https://access.redhat.com/errata/RHSA-2011:1197"
      },
      {
        "Source": "CVE",
        "RefID": "CVE-2011-2511",
        "RefURL": "https://access.redhat.com/security/cve/CVE-2011-2511"
      }
    ],
    "Description": "The libvirt library is a C API for managing and interacting with the\nvirtualization capabilities of Linux and other operating systems. In\naddition, libvirt provides tools for remotely managing virtualized systems.\n\nAn integer overflow flaw was found in libvirtd's RPC call handling. An\nattacker able to establish read-only connections to libvirtd could trigger\nthis flaw by calling virDomainGetVcpus() with specially-crafted parameters,\ncausing libvirtd to crash. (CVE-2011-2511)\n\nThis update also fixes the following bugs:\n\n* Previously, when the \"virsh vol-create-from\" command was run on an LVM\n(Logical Volume Manager) storage pool, performance of the command was very\nlow and the operation consumed an excessive amount of time. This bug has\nbeen fixed in the virStorageVolCreateXMLFrom() function, and the\nperformance problem of the command no longer occurs.\n\n* Due to a regression, libvirt used undocumented command line options,\ninstead of the recommended ones. Consequently, the qemu-img utility used an\ninvalid argument while creating an encrypted volume, and the process\neventually failed. With this update, the bug in the backing format of the\nstorage back end has been fixed, and encrypted volumes can now be created\nas expected. (BZ#726617)\n\n* Due to a bug in the qemuAuditDisk() function, hot unplug failures were\nnever audited, and a hot unplug success was audited as a failure. This bug\nhas been fixed, and auditing of disk hot unplug operations now works as\nexpected. (BZ#728516)\n\n* Previously, when a debug process was being activated, the act of\npreparing a debug message ended up with dereferencing a UUID (universally\nunique identifier) prior to the NULL argument check. Consequently, an API\nrunning the debug process sometimes terminated with a segmentation fault.\nWith this update, a patch has been provided to address this issue, and the\ncrashes no longer occur in the described scenario. (BZ#728546)\n\n* The libvirt library uses the \"boot=on\" option to mark which disk is\nbootable but it only uses that option if Qemu advertises its support. The\nqemu-kvm utility in Red Hat Enterprise Linux 6.1 removed support for that\noption and libvirt could not use it. As a consequence, when an IDE disk was\nadded as the second storage with a virtio disk being set up as the first\none by default, the operating system tried to boot from the IDE disk rather\nthan the virtio disk and either failed to boot with the \"No bootable disk\"\nerror message returned, or the system booted whatever operating system was\non the IDE disk. With this update, the boot configuration is translated\ninto bootindex, which provides control over which device is used for\nbooting a guest operating system, thus fixing this bug.\n\nAll users of libvirt are advised to upgrade to these updated packages,\nwhich contain backported patches to correct these issues. After installing\nthe updated packages, libvirtd must be restarted (\"service libvirtd\nrestart\") for this update to take effect.",
    "Advisory": {
      "From": "secalert@redhat.com",
      "Severity": "Moderate",
      "Rights": "Copyright 2011 Red Hat, Inc.",
      "Issued": {
        "Date": "2011-08-23"
      },
      "Updated": {
        "Date": "2011-08-23"
      },
      "Cves": [
        {
          "CveID": "CVE-2011-2511",
          "Cvss2": "3.3/AV:A/AC:L/Au:N/C:N/I:N/A:P",
          "Cwe": "CWE-190",
          "Impact": "moderate",
          "Href": "https://access.redhat.com/security/cve/CVE-2011-2511",
          "Public": "20110624"
        }
      ],
      "Bugzilla": [
        {
          "Href": "https://bugzilla.redhat.com/717199",
          "ID": "717199"
        }
      ],
      "AffectedCpeList": [
        "cpe:/o:redhat:rhel_tus:6.6",
        "cpe:/o:redhat:rhel_tus:6.6::server"
      ],
      "Affected": {
        "Resolution": {}
      }
    }
  },
  "Criteria": {
    "Operator": "OR",
    "Criterions": [
      {
        "Comment": "Red Hat Enterprise Linux must be installed",
        "TestRef": "oval:com.redhat.rhba:tst:20111656004"
      }
    ],
    "Criterias": [
      {
        "Operator": "AND",
        "Criterions": [
          {
            "Comment": "Red Hat Enterprise Linux 6 is installed",
            "TestRef": "oval:com.redhat.rhba:tst:20111656003"
          }
        ],
        "Criterias": [
          {
            "Operator": "OR",
            "Criterias": [
              {
                "Operator": "AND",
                "Criterions": [
                  {
                    "Comment": "libvirt is earlier than 0:0.8.7-18.el6_1.1",
                    "TestRef": "oval:com.redhat.rhsa:tst:20111197001"
                  },
                  {
                    "Comment": "libvirt is signed with Red Hat redhatrelease2 key",
                    "TestRef": "oval:com.redhat.rhba:tst:20131581002"
                  }
                ]
              },
              {
                "Operator": "AND",
                "Criterions": [
                  {
                    "Comment": "libvirt-client is earlier than 0:0.8.7-18.el6_1.1",
                    "TestRef": "oval:com.redhat.rhsa:tst:20111197003"
                  },
                  {
                    "Comment": "libvirt-client is signed with Red Hat redhatrelease2 key",
                    "TestRef": "oval:com.redhat.rhba:tst:20131581004"
                  }
                ]
              },
              {
                "Operator": "AND",
                "Criterions": [
                  {
                    "Comment": "libvirt-devel is earlier than 0:0.8.7-18.el6_1.1",
                    "TestRef": "oval:com.redhat.rhsa:tst:20111197005"
                  },
                  {
                    "Comment": "libvirt-devel is signed with Red Hat redhatrelease2 key",
                    "TestRef": "oval:com.redhat.rhba:tst:20131581006"
                  }
                ]
              },
              {
                "Operator": "AND",
                "Criterions": [
                  {
                    "Comment": "libvirt-python is earlier than 0:0.8.7-18.el6_1.1",
                    "TestRef": "oval:com.redhat.rhsa:tst:20111197007"
                  },
                  {
                    "Comment": "libvirt-python is signed with Red Hat redhatrelease2 key",
                    "TestRef": "oval:com.redhat.rhba:tst:20131581010"
                  }
                ]
              }
            ]
          }
        ]
      }
    ]
  }
}