{
  "Class": "patch",
  "ID": "oval:com.redhat.rhsa:def:20152417",
  "Version": "644",
  "Metadata": {
    "Title": "RHSA-2015:2417: autofs security, bug fix and enhancement update (Moderate)",
    "AffectedList": [
      {
        "Family": "unix",
        "Platforms": [
          "Red Hat Enterprise Linux 7"
        ]
      }
    ],
    "References": [
      {
        "Source": "RHSA",
        "RefID": "RHSA-2015:2417",
        "RefURL": "https://access.redhat.com/errata/RHSA-2015:2417"
      },
      {
        "Source": "CVE",
        "RefID": "CVE-2014-8169",
        "RefURL": "https://access.redhat.com/security/cve/CVE-2014-8169"
      }
    ],
    "Description": "The autofs utility controls the operation of the automount daemon. The\ndaemon automatically mounts file systems when in use and unmounts them when\nthey are not busy.\n\nIt was found that program-based automounter maps that used interpreted\nlanguages such as Python used standard environment variables to locate\nand load modules of those languages. A local attacker could potentially use\nthis flaw to escalate their privileges on the system. (CVE-2014-8169)\n\nNote: This issue has been fixed by adding the \"AUTOFS_\" prefix to the\naffected environment variables so that they are not used to subvert the\nsystem. A configuration option (\"force_standard_program_map_env\") to\noverride this prefix and to use the environment variables without the\nprefix has been added. In addition, warnings have been added to the manual\npage and to the installed configuration file. Now, by default the standard\nvariables of the program map are provided only with the prefix added to\nits name.\n\nRed Hat would like to thank the Georgia Institute of Technology for\nreporting this issue.\n\nNotably, this update fixes the following bugs:\n\n* When the \"ls *\" command was run in the root of an indirect mount, autofs\nattempted to literally mount the wildcard character (*) causing it to be\nadded to the negative cache. If done before a valid mount, autofs then\nfailed on further mount attempts inside the mount point, valid or not. This\nhas been fixed, and wildcard map entries now function in the described\nsituation. (BZ#1166457)\n\n* When autofs encountered a syntax error consisting of a duplicate entry in\na multimap entry, it reported an error and did not mount the map entry.\nWith this update, autofs has been amended to report the problem in the log\nto alert the system administrator and use the last seen instance of the\nduplicate entry rather than fail. (BZ#1205600)\n\n* In the ldap and sss lookup modules, the map reading functions did not\ndistinguish between the \"no entry found\" and \"service not available\"\nerrors. Consequently, when the \"service not available\" response was\nreturned from a master map read, autofs did not update the mounts.\nAn \"entry not found\" return does not prevent the map update, so the ldap\nand sss lookup modules were updated to distinguish between these two\nreturns and now work as expected. (BZ#1233065)\n\nIn addition, this update adds the following enhancement:\n\n* The description of the configuration parameter map_hash_table_size was\nmissing from the autofs.conf(5) man page and its description in the\nconfiguration file comments was insufficient. A description of the\nparameter has been added to autofs.conf(5), and the configuration file\ncomments have been updated. (BZ#1238573)\n\nAll autofs users are advised to upgrade to these updated packages, which\ncontain backported patches to correct these issues and add this\nenhancement.",
    "Advisory": {
      "From": "secalert@redhat.com",
      "Severity": "Moderate",
      "Rights": "Copyright 2015 Red Hat, Inc.",
      "Issued": {
        "Date": "2015-11-19"
      },
      "Updated": {
        "Date": "2015-11-19"
      },
      "Cves": [
        {
          "CveID": "CVE-2014-8169",
          "Cvss2": "4.6/AV:L/AC:L/Au:N/C:P/I:P/A:P",
          "Cwe": "CWE-20-\u003eCWE-426",
          "Impact": "moderate",
          "Href": "https://access.redhat.com/security/cve/CVE-2014-8169",
          "Public": "20150302"
        }
      ],
      "Bugzilla": [
        {
          "Href": "https://bugzilla.redhat.com/1192565",
          "ID": "1192565"
        }
      ],
      "AffectedCpeList": [
        "cpe:/a:redhat:rhel_extras_sap_eus:7.2",
        "cpe:/a:redhat:rhel_extras_sap_hana_eus:7.2",
        "cpe:/o:redhat:rhel_eus:7.1",
        "cpe:/o:redhat:rhel_eus:7.1::server",
        "cpe:/o:redhat:rhel_eus:7.2",
        "cpe:/o:redhat:rhel_eus:7.2::computenode",
        "cpe:/o:redhat:rhel_eus:7.2::server"
      ],
      "Affected": {
        "Resolution": {}
      }
    }
  },
  "Criteria": {
    "Operator": "OR",
    "Criterions": [
      {
        "Comment": "Red Hat Enterprise Linux must be installed",
        "TestRef": "oval:com.redhat.rhba:tst:20150364028"
      }
    ],
    "Criterias": [
      {
        "Operator": "AND",
        "Criterions": [
          {
            "Comment": "Red Hat Enterprise Linux 7 is installed",
            "TestRef": "oval:com.redhat.rhba:tst:20150364027"
          },
          {
            "Comment": "autofs is earlier than 1:5.0.7-54.el7",
            "TestRef": "oval:com.redhat.rhsa:tst:20152417001"
          },
          {
            "Comment": "autofs is signed with Red Hat redhatrelease2 key",
            "TestRef": "oval:com.redhat.rhsa:tst:20152417002"
          }
        ]
      }
    ]
  }
}