{
  "Class": "patch",
  "ID": "oval:com.redhat.rhsa:def:20151344",
  "Version": "646",
  "Metadata": {
    "Title": "RHSA-2015:1344: autofs security and bug fix update (Moderate)",
    "AffectedList": [
      {
        "Family": "unix",
        "Platforms": [
          "Red Hat Enterprise Linux 6"
        ]
      }
    ],
    "References": [
      {
        "Source": "RHSA",
        "RefID": "RHSA-2015:1344",
        "RefURL": "https://access.redhat.com/errata/RHSA-2015:1344"
      },
      {
        "Source": "CVE",
        "RefID": "CVE-2014-8169",
        "RefURL": "https://access.redhat.com/security/cve/CVE-2014-8169"
      }
    ],
    "Description": "The autofs utility controls the operation of the automount daemon. The \ndaemon automatically mounts file systems when in use and unmounts them when \nthey are not busy.\n\nIt was found that program-based automounter maps that used interpreted\nlanguages such as Python would use standard environment variables to locate\nand load modules of those languages. A local attacker could potentially use\nthis flaw to escalate their privileges on the system. (CVE-2014-8169)\n\nNote: This issue has been fixed by adding the \"AUTOFS_\" prefix to the\naffected environment variables so that they are not used to subvert the\nsystem. A configuration option (\"force_standard_program_map_env\") to\noverride this prefix and to use the environment variables without the\nprefix has been added. In addition, warnings have been added to the manual\npage and to the installed configuration file. Now, by default the standard\nvariables of the program map are provided only with the prefix added to\nits name.\n\nRed Hat would like to thank the Georgia Institute of Technology for\nreporting this issue.\n\nBug fixes:\n\n* If the \"ls *\" command was executed before a valid mount, the autofs\nprogram failed on further mount attempts inside the mount point, whether\nthe mount point was valid or not. While attempting to mount, the \"ls *\"\ncommand of the root directory of an indirect mount was executed, which\nled to an attempt to mount \"*\", causing it to be added to the negative\nmap entry cache. This bug has been fixed by checking for and not adding\n\"*\" while updating the negative map entry cache. (BZ#1163957)\n\n* The autofs program by design did not mount host map entries that were\nduplicate exports in an NFS server export list. The duplicate entries in a\nmulti-mount map entry were recognized as a syntax error and autofs refused\nto perform mounts when the duplicate entries occurred. Now, autofs has been\nchanged to continue mounting the last seen instance of the duplicate entry\nrather than fail, and to report the problem in the log files to alert the\nsystem administrator. (BZ#1124083)\n\n* The autofs program did not recognize the yp map type in the master map.\nThis was caused by another change in the master map parser to fix a problem\nwith detecting the map format associated with mapping the type in the\nmaster map. The change led to an incorrect length for the type comparison\nof yp maps that resulted in a match operation failure. This bug has been\nfixed by correcting the length which is used for the comparison.\n(BZ#1153130)\n\n* The autofs program did not update the export list of the Sun-format maps\nof the network shares exported from an NFS server. This happened due to a\nchange of the Sun-format map parser leading to the hosts map update to stop\nworking on the map re-read operation. The bug has been now fixed by\nselectively preventing this type of update only for the Sun-formatted maps.\nThe updates of the export list on the Sun-format maps are now visible and\nrefreshing of the export list is no longer supported for the Sun-formatted\nhosts map. (BZ#1156387)\n\n* Within changes made for adding of the Sun-format maps, an incorrect check \nwas added that caused a segmentation fault in the Sun-format map parser in \ncertain circumstances. This has been now fixed by analyzing the intent of \nthe incorrect check and changing it in order to properly identify the \nconditions without causing a fault. (BZ#1175671)\n\n* A bug in the autofs program map lookup module caused an incorrect map\nformat type comparison. The incorrect comparison affected the Sun-format\nprogram maps where it led to the unused macro definitions. The bug in the\ncomparison has been fixed so that the macro definitions are not present for\nthe Sun-format program maps. (BZ#1201195)\n\nUsers of autofs are advised to upgrade to these updated packages, which\ncontain backported patches to correct these issues.",
    "Advisory": {
      "From": "secalert@redhat.com",
      "Severity": "Moderate",
      "Rights": "Copyright 2015 Red Hat, Inc.",
      "Issued": {
        "Date": "2015-07-20"
      },
      "Updated": {
        "Date": "2015-07-22"
      },
      "Cves": [
        {
          "CveID": "CVE-2014-8169",
          "Cvss2": "4.6/AV:L/AC:L/Au:N/C:P/I:P/A:P",
          "Cwe": "CWE-20-\u003eCWE-426",
          "Impact": "moderate",
          "Href": "https://access.redhat.com/security/cve/CVE-2014-8169",
          "Public": "20150302"
        }
      ],
      "Bugzilla": [
        {
          "Href": "https://bugzilla.redhat.com/1192565",
          "ID": "1192565"
        }
      ],
      "AffectedCpeList": [
        "cpe:/a:redhat:rhel_extras:6",
        "cpe:/a:redhat:rhel_extras_hpn:6",
        "cpe:/a:redhat:rhel_extras_oracle_java:6",
        "cpe:/a:redhat:rhel_extras_sap:6",
        "cpe:/a:redhat:rhel_extras_sap_hana:6",
        "cpe:/o:redhat:enterprise_linux:6",
        "cpe:/o:redhat:enterprise_linux:6::client",
        "cpe:/o:redhat:enterprise_linux:6::computenode",
        "cpe:/o:redhat:enterprise_linux:6::server",
        "cpe:/o:redhat:enterprise_linux:6::workstation"
      ],
      "Affected": {
        "Resolution": {}
      }
    }
  },
  "Criteria": {
    "Operator": "OR",
    "Criterions": [
      {
        "Comment": "Red Hat Enterprise Linux must be installed",
        "TestRef": "oval:com.redhat.rhba:tst:20111656004"
      }
    ],
    "Criterias": [
      {
        "Operator": "AND",
        "Criterions": [
          {
            "Comment": "Red Hat Enterprise Linux 6 is installed",
            "TestRef": "oval:com.redhat.rhba:tst:20111656003"
          },
          {
            "Comment": "autofs is earlier than 1:5.0.5-113.el6",
            "TestRef": "oval:com.redhat.rhsa:tst:20151344001"
          },
          {
            "Comment": "autofs is signed with Red Hat redhatrelease2 key",
            "TestRef": "oval:com.redhat.rhsa:tst:20151344002"
          }
        ]
      }
    ]
  }
}