{
  "Class": "patch",
  "ID": "oval:com.redhat.rhsa:def:20182598",
  "Version": "641",
  "Metadata": {
    "Title": "RHSA-2018:2598: opendaylight security and bug fix update (Moderate)",
    "AffectedList": [
      {
        "Family": "unix",
        "Platforms": [
          "Red Hat OpenStack Platform 13.0 (Queens)"
        ]
      }
    ],
    "References": [
      {
        "Source": "RHSA",
        "RefID": "RHSA-2018:2598",
        "RefURL": "https://access.redhat.com/errata/RHSA-2018:2598"
      },
      {
        "Source": "CVE",
        "RefID": "CVE-2018-10237",
        "RefURL": "https://access.redhat.com/security/cve/CVE-2018-10237"
      }
    ],
    "Description": "OpenDaylight (ODL) is a modular open platform for customizing and automating networks of any size and scale. The OpenDaylight Project arose out of the SDN movement, with a clear focus on network programmability.\n\nSecurity Fix(es):\n\n* guava: Unbounded memory allocation in AtomicDoubleArray and CompoundOrdering classes allow remote attackers to cause a denial of service (CVE-2018-10237)\n\nFor more details about the security issue(s), including the impact, a CVSS score, and other related information, refer to the CVE page(s) listed in the References section.\n\nBug Fix(es):\n\n* Previously, when there are no DPNs associated with the controller, an Invalid dpnId, for example, zero, was selected as the NAPT Switch. Since the dpnId was zero, necessary flows for supporting external connectivity for VMs were missing in the pipeline. So VMs were unable to connect to internet.\nNow, the Invalid dpnId is not chosen as an NAPT Switch and as soon as a new DPN is associated with the OpenDaylight controller, it will schedule the NAPT Switches for all the routers, that did not have the NAPT switch scheduled.\nAs a result, VMs are now able to reach internet. (BZ#1597304)\n\n* Some flows were missing from the ARP table and the flow programming generated an error due to a missing group. As a result, L2 failed and affected most of the traffic.\nThe flow programming now waits for the group to be added. The group is always present and L2 traffic succeeds. (BZ#1598399)\n\n* In OVS2.9, conntrack adds extra headers that the OpenFlow plugin cannot parse. As a result, traffic from the VM to a PNF on external network failed.\nThe extra headers are now explicit cleared. Traffic to PNF on external network does not fail. (BZ#1600608)\n\n* Some flows were missing from the SNAT table and the flow programming generated an error due to a missing group. As a result, SNAT traffic from compute, where the flow is missing,  failed and affected most of the traffic.\nAs a result, the flow programming now waits for the group to be added.  The group is always present and SNAT works. (BZ#1602404)\n\n* Previously, the transaction did not close in netvirt.vpnmanager.VpnOpStatusListener. This resulted in memory leaks at scale and/or in longevity. This issue has been resolved and now OpenDaylight requires less memory to run. (BZ#1607965)\n\n* Previously, the transaction did not close in netvirt.fibmanager.VrfEntryListener. This resulted in memory leaks at scale and/or in longevity. This issue has been resolved and OpenDaylight now requires less memory to run. (BZ#1585227)",
    "Advisory": {
      "From": "secalert@redhat.com",
      "Severity": "Moderate",
      "Rights": "Copyright 2018 Red Hat, Inc.",
      "Issued": {
        "Date": "2018-08-29"
      },
      "Updated": {
        "Date": "2018-08-29"
      },
      "Cves": [
        {
          "CveID": "CVE-2018-10237",
          "Cvss3": "5.9/CVSS:3.0/AV:N/AC:H/PR:N/UI:N/S:U/C:N/I:N/A:H",
          "Cwe": "CWE-119",
          "Impact": "moderate",
          "Href": "https://access.redhat.com/security/cve/CVE-2018-10237",
          "Public": "20180425"
        }
      ],
      "Bugzilla": [
        {
          "Href": "https://bugzilla.redhat.com/1573391",
          "ID": "1573391"
        }
      ],
      "AffectedCpeList": [
        "cpe:/a:redhat:openstack-optools:13",
        "cpe:/a:redhat:openstack-optools:13::el7",
        "cpe:/a:redhat:openstack:13",
        "cpe:/a:redhat:openstack:13::el7"
      ],
      "Affected": {
        "Resolution": {}
      }
    }
  },
  "Criteria": {
    "Operator": "OR",
    "Criterions": [
      {
        "Comment": "Red Hat Enterprise Linux must be installed",
        "TestRef": "oval:com.redhat.cve:tst:20115034004"
      }
    ],
    "Criterias": [
      {
        "Operator": "AND",
        "Criterions": [
          {
            "Comment": "Red Hat Enterprise Linux 7 is installed",
            "TestRef": "oval:com.redhat.cve:tst:20115034003"
          },
          {
            "Comment": "opendaylight is earlier than 0:8.3.0-3.el7ost",
            "TestRef": "oval:com.redhat.rhsa:tst:20182598001"
          },
          {
            "Comment": "opendaylight is signed with Red Hat redhatrelease2 key",
            "TestRef": "oval:com.redhat.cve:tst:20115034002"
          }
        ]
      }
    ]
  }
}