{
  "Class": "patch",
  "ID": "oval:com.redhat.rhsa:def:20151417",
  "Version": "640",
  "Metadata": {
    "Title": "RHSA-2015:1417: mailman security and bug fix update (Moderate)",
    "AffectedList": [
      {
        "Family": "unix",
        "Platforms": [
          "Red Hat Enterprise Linux 6"
        ]
      }
    ],
    "References": [
      {
        "Source": "RHSA",
        "RefID": "RHSA-2015:1417",
        "RefURL": "https://access.redhat.com/errata/RHSA-2015:1417"
      },
      {
        "Source": "CVE",
        "RefID": "CVE-2002-0389",
        "RefURL": "https://access.redhat.com/security/cve/CVE-2002-0389"
      },
      {
        "Source": "CVE",
        "RefID": "CVE-2015-2775",
        "RefURL": "https://access.redhat.com/security/cve/CVE-2015-2775"
      }
    ],
    "Description": "Mailman is a program used to help manage e-mail discussion lists.\n\nIt was found that mailman did not sanitize the list name before passing it\nto certain MTAs. A local attacker could use this flaw to execute arbitrary\ncode as the user running mailman. (CVE-2015-2775)\n\nIt was found that mailman stored private email messages in a world-readable\ndirectory. A local user could use this flaw to read private mailing list\narchives. (CVE-2002-0389)\n\nThis update also fixes the following bugs:\n\n* Previously, it was impossible to configure Mailman in a way that\nDomain-based Message Authentication, Reporting \u0026 Conformance (DMARC) would\nrecognize Sender alignment for Domain Key Identified Mail (DKIM)\nsignatures. Consequently, Mailman list subscribers that belonged to a mail\nserver with a \"reject\" policy for DMARC, such as yahoo.com or AOL.com, were\nunable to receive Mailman forwarded messages from senders residing in any\ndomain that provided DKIM signatures. With this update, domains with a\n\"reject\" DMARC policy are recognized correctly, and Mailman list\nadministrators are able to configure the way these messages are handled.\nAs a result, after a proper configuration, subscribers now correctly\nreceive Mailman forwarded messages in this scenario. (BZ#1095359)\n\n* Mailman used a console encoding when generating a subject for a \"welcome\nemail\" when new mailing lists were created by the \"newlist\" command.\nConsequently, when the console encoding did not match the encoding used by\nMailman for that particular language, characters in the \"welcome email\"\ncould be displayed incorrectly. Mailman has been fixed to use the correct\nencoding, and characters in the \"welcome email\" are now displayed properly.\n(BZ#1056366)\n\n* The \"rmlist\" command used a hardcoded path to list data based on the\nVAR_PREFIX configuration variable. As a consequence, when the list was\ncreated outside of VAR_PREFIX, it was impossible to remove it using the\n\"rmlist\" command. With this update, the \"rmlist\" command uses the correct\nLIST_DATA_DIR value instead of VAR_PREFIX, and it is now possible to remove\nthe list in described situation. (BZ#1008139)\n\n* Due to an incompatibility between Python and Mailman in Red Hat\nEnterprise Linux 6, when moderators were approving a moderated message to a\nmailing list and checked the \"Preserve messages for the site administrator\"\ncheckbox, Mailman failed to approve the message and returned an error.\nThis incompatibility has been fixed, and Mailman now approves messages as\nexpected in this scenario. (BZ#765807)\n\n* When Mailman was set to not archive a list but the archive was not set to\nprivate, attachments sent to that list were placed in a public archive.\nConsequently, users of Mailman web interface could list private attachments\nbecause httpd configuration of public archive directory allows listing all\nfiles in the archive directory. The httpd configuration of Mailman has been\nfixed to not allow listing of private archive directory, and users of\nMailman web interface are no longer able to list private attachments.\n(BZ#745409)\n\nUsers of mailman are advised to upgrade to these updated packages, which\ncontain backported patches to correct these issues.",
    "Advisory": {
      "From": "secalert@redhat.com",
      "Severity": "Moderate",
      "Rights": "Copyright 2015 Red Hat, Inc.",
      "Issued": {
        "Date": "2015-07-20"
      },
      "Updated": {
        "Date": "2015-07-22"
      },
      "Cves": [
        {
          "CveID": "CVE-2002-0389",
          "Cvss2": "2.1/AV:L/AC:L/Au:N/C:P/I:N/A:N",
          "Impact": "low",
          "Href": "https://access.redhat.com/security/cve/CVE-2002-0389",
          "Public": "20080819"
        },
        {
          "CveID": "CVE-2015-2775",
          "Cvss2": "4.6/AV:L/AC:L/Au:N/C:P/I:P/A:P",
          "Cwe": "CWE-22",
          "Impact": "moderate",
          "Href": "https://access.redhat.com/security/cve/CVE-2015-2775",
          "Public": "20150331"
        }
      ],
      "Bugzilla": [
        {
          "Href": "https://bugzilla.redhat.com/723584",
          "ID": "723584"
        },
        {
          "Href": "https://bugzilla.redhat.com/1208059",
          "ID": "1208059"
        }
      ],
      "AffectedCpeList": [
        "cpe:/o:redhat:rhel_eus:6.1"
      ],
      "Affected": {
        "Resolution": {}
      }
    }
  },
  "Criteria": {
    "Operator": "OR",
    "Criterions": [
      {
        "Comment": "Red Hat Enterprise Linux must be installed",
        "TestRef": "oval:com.redhat.rhba:tst:20111656004"
      }
    ],
    "Criterias": [
      {
        "Operator": "AND",
        "Criterions": [
          {
            "Comment": "Red Hat Enterprise Linux 6 is installed",
            "TestRef": "oval:com.redhat.rhba:tst:20111656003"
          },
          {
            "Comment": "mailman is earlier than 3:2.1.12-25.el6",
            "TestRef": "oval:com.redhat.rhsa:tst:20151417001"
          },
          {
            "Comment": "mailman is signed with Red Hat redhatrelease2 key",
            "TestRef": "oval:com.redhat.rhsa:tst:20110308002"
          }
        ]
      }
    ]
  }
}