{
  "Class": "patch",
  "ID": "oval:com.redhat.rhsa:def:20152290",
  "Version": "644",
  "Metadata": {
    "Title": "RHSA-2015:2290: pcs security, bug fix, and enhancement update (Moderate)",
    "AffectedList": [
      {
        "Family": "unix",
        "Platforms": [
          "Red Hat Enterprise Linux 7"
        ]
      }
    ],
    "References": [
      {
        "Source": "RHSA",
        "RefID": "RHSA-2015:2290",
        "RefURL": "https://access.redhat.com/errata/RHSA-2015:2290"
      },
      {
        "Source": "CVE",
        "RefID": "CVE-2015-3225",
        "RefURL": "https://access.redhat.com/security/cve/CVE-2015-3225"
      }
    ],
    "Description": "The pcs package provides a configuration tool for Corosync and Pacemaker.\nIt permits users to easily view, modify and create Pacemaker based\nclusters. The pcs package includes Rack, which provides a minimal interface\nbetween webservers that support Ruby and Ruby frameworks.\n\nA flaw was found in a way Rack processed parameters of incoming requests.\nAn attacker could use this flaw to send a crafted request that would cause\nan application using Rack to crash. (CVE-2015-3225)\n\nRed Hat would like to thank Ruby upstream developers for reporting this.\nUpstream acknowledges Tomek Rabczak from the NCC Group as the original\nreporter.\n\nThe pcs package has been upgraded to upstream version 0.9.143, which\nprovides a number of bug fixes and enhancements over the previous version.\n(BZ#1198265)\n\nThe following enhancements are described in more detail in the Red Hat\nEnterprise Linux 7.2 Release Notes, linked to from the References section:\n\n* The pcs resource move and pcs resource ban commands now display a warning\nmessage to clarify the commands' behavior (BZ#1201452)\n\n* New command to move a Pacemaker resource to its preferred node\n(BZ#1122818)\n\nThis update also fixes the following bugs:\n\n* Before this update, a bug caused location, ordering, and colocation\nconstraints related to a resource group to be removed when removing any\nresource from that group. This bug has been fixed, and the constraints are\nnow preserved until the group has no resources left, and is removed.\n(BZ#1158537)\n\n* Previously, when a user disabled a resource clone or multi-state\nresource, and then later enabled a primitive resource within it, the clone\nor multi-state resource remained disabled. With this update, enabling a\nresource within a disabled clone or multi-state resource enables it.\n(BZ#1218979)\n\n* When the web UI displayed a list of resource attributes, a bug caused\nthe list to be truncated at the first \"=\" character. This update fixes the\nbug and now the web UI displays lists of resource attributes correctly.\n(BZ#1243579)\n\n* The documentation for the \"pcs stonith confirm\" command was not clear.\nThis could lead to incorrect usage of the command, which could in turn\ncause data corruption. With this update, the documentation has been\nimproved and the \"pcs stonith confirm\" command is now more clearly\nexplained. (BZ#1245264)\n\n* Previously, if there were any unauthenticated nodes, creating a new\ncluster, adding a node to an existing cluster, or adding a cluster to the\nweb UI failed with the message \"Node is not authenticated\". With this\nupdate, when the web UI detects a problem with authentication, the web UI\ndisplays a dialog to authenticate nodes as necessary. (BZ#1158569)\n\n* Previously, the web UI displayed only primitive resources. Thus there was\nno way to set attributes, constraints and other properties separately for a\nparent resource and a child resource. This has now been fixed, and\nresources are displayed in a tree structure, meaning all resource elements\ncan be viewed and edited independently. (BZ#1189857)\n\nIn addition, this update adds the following enhancements:\n\n* A dashboard has been added which shows the status of clusters in the web\nUI. Previously, it was not possible to view all important information about\nclusters in one place. Now, a dashboard showing the status of clusters has\nbeen added to the main page of the web UI. (BZ#1158566)\n\n* With this update, the pcsd daemon automatically synchronizes pcsd\nconfiguration across a cluster. This enables the web UI to be run from any\nnode, allowing management even if any particular node is down. (BZ#1158577)\n\n* The web UI can now be used to set permissions for users and groups on a\ncluster. This allows users and groups to have their access restricted to\ncertain operations on certain clusters. (BZ#1158571)\n\nAll pcs users are advised to upgrade to this updated package, which\ncorrects these issues and add these enhancements.",
    "Advisory": {
      "From": "secalert@redhat.com",
      "Severity": "Moderate",
      "Rights": "Copyright 2015 Red Hat, Inc.",
      "Issued": {
        "Date": "2015-11-19"
      },
      "Updated": {
        "Date": "2015-11-19"
      },
      "Cves": [
        {
          "CveID": "CVE-2015-3225",
          "Cvss2": "4.3/AV:N/AC:M/Au:N/C:N/I:N/A:P",
          "Cwe": "CWE-400",
          "Impact": "moderate",
          "Href": "https://access.redhat.com/security/cve/CVE-2015-3225",
          "Public": "20150616"
        }
      ],
      "Bugzilla": [
        {
          "Href": "https://bugzilla.redhat.com/1232292",
          "ID": "1232292"
        }
      ],
      "AffectedCpeList": [
        "cpe:/o:redhat:rhel_aus:7.2",
        "cpe:/o:redhat:rhel_aus:7.2::server"
      ],
      "Affected": {
        "Resolution": {}
      }
    }
  },
  "Criteria": {
    "Operator": "OR",
    "Criterions": [
      {
        "Comment": "Red Hat Enterprise Linux must be installed",
        "TestRef": "oval:com.redhat.rhba:tst:20150364028"
      }
    ],
    "Criterias": [
      {
        "Operator": "AND",
        "Criterions": [
          {
            "Comment": "Red Hat Enterprise Linux 7 is installed",
            "TestRef": "oval:com.redhat.rhba:tst:20150364027"
          },
          {
            "Comment": "pcs is earlier than 0:0.9.143-15.el7",
            "TestRef": "oval:com.redhat.rhsa:tst:20152290001"
          },
          {
            "Comment": "pcs is signed with Red Hat redhatrelease2 key",
            "TestRef": "oval:com.redhat.rhsa:tst:20150980002"
          }
        ]
      }
    ]
  }
}