{
  "Class": "patch",
  "ID": "oval:com.redhat.rhsa:def:20161034",
  "Version": "644",
  "Metadata": {
    "Title": "RHSA-2016:1034: docker security, bug fix, and enhancement update (Moderate)",
    "AffectedList": [
      {
        "Family": "unix",
        "Platforms": [
          "Red Hat Enterprise Linux 7 Extras"
        ]
      }
    ],
    "References": [
      {
        "Source": "RHSA",
        "RefID": "RHSA-2016:1034",
        "RefURL": "https://access.redhat.com/errata/RHSA-2016:1034"
      },
      {
        "Source": "CVE",
        "RefID": "CVE-2016-3697",
        "RefURL": "https://access.redhat.com/security/cve/CVE-2016-3697"
      }
    ],
    "Description": "Docker is an open-source engine that automates the deployment of any application as a lightweight, portable, self-sufficient container that will run virtually anywhere.\n\nSecurity Fix(es):\n\n* It was found that Docker would launch containers under the specified UID instead of a username. An attacker able to launch a container could use this flaw to escalate their privileges to root within the launched container. (CVE-2016-3697)\n\nThis issue was discovered by Mrunal Patel (Red Hat).\n\nBug Fix(es):\n\n* The process of pulling an image spawns a new \"goroutine\" for each layer in the image manifest. If any of these downloads, everything stops and an error is returned, even though other goroutines would still be running and writing output through a progress reader which is attached to an http response writer. Since the request handler had already returned from the first error, the http server panics when one of these download goroutines makes a write to the response writer buffer. This bug has been fixed, and docker no longer panics when pulling an image. (BZ#1264562)\n\n* Previously, in certain situations, a container rootfs remained busy during container removal. This typically happened if a container mount point leaked into another mount namespace. As a consequence, container removal failed. To fix this bug, a new docker daemon option \"dm.use_deferred_deletion\" has been provided. If set to true, this option will defer the container rootfs deletion. The user will see success on container removal but the actual thin device backing the rootfs will be deleted later when it is not busy anymore. (BZ#1190492)\n \t\n* Previously, the Docker unit file had the \"Restart\" option set to \"on-failure\". Consequently, the docker daemon was forced to restart even in cases where it couldn't be started because of configuration or other issues and this situation forced unnecessary restarts of the docker-storage-setup service in a loop. This also caused real error messages to be lost due to so many restarts. To fix this bug, \"Restart=on-failure\" has been replaced with \"Restart=on-abnormal\" in the docker unit file. As a result, the docker daemon will not automatically restart if it fails with an unclean exit code. (BZ#1319783)\n\n* Previously, the request body was incorrectly read twice by the docker daemon and consequently, an EOF error was returned. To fix this bug, the code which incorrectly read the request body the first time has been removed. As a result, the EOF error is no longer returned and the body is correctly read when really needed. (BZ#1329743)\n\nEnhancement(s):\n\n* The /usr/bin/docker script now calls /usr/bin/docker-current or /usr/bin/docker-latest based on the value of the sysconfig variable DOCKERBINARY present in /etc/sysconfig/docker. /usr/bin/docker and /etc/sysconfig/docker provided by the docker-common package allow the admin to configure which docker client binary gets called. /usr/bin/docker will call /usr/bin/docker-latest by default when docker is not installed. If docker is installed, /usr/bin/docker will call /usr/bin/docker-current by default, unless DOCKERBINARY is set to /usr/bin/docker-latest in /etc/sysconfig/docker. This way, you can use docker-latest or docker without the need to check which version of the daemon is currently running. (BZ#1328219)",
    "Advisory": {
      "From": "secalert@redhat.com",
      "Severity": "Moderate",
      "Rights": "Copyright 2016 Red Hat, Inc.",
      "Issued": {
        "Date": "2016-05-12"
      },
      "Updated": {
        "Date": "2016-05-12"
      },
      "Cves": [
        {
          "CveID": "CVE-2016-3697",
          "Cvss2": "6.0/AV:N/AC:M/Au:S/C:P/I:P/A:P",
          "Impact": "moderate",
          "Href": "https://access.redhat.com/security/cve/CVE-2016-3697",
          "Public": "20160422"
        }
      ],
      "Bugzilla": [
        {
          "Href": "https://bugzilla.redhat.com/1329450",
          "ID": "1329450"
        }
      ],
      "AffectedCpeList": [
        "cpe:/a:redhat:rhel_extras_other:7"
      ],
      "Affected": {
        "Resolution": {}
      }
    }
  },
  "Criteria": {
    "Operator": "OR",
    "Criterions": [
      {
        "Comment": "Red Hat Enterprise Linux must be installed",
        "TestRef": "oval:com.redhat.rhba:tst:20141977004"
      }
    ],
    "Criterias": [
      {
        "Operator": "AND",
        "Criterions": [
          {
            "Comment": "Red Hat Enterprise Linux 7 is installed",
            "TestRef": "oval:com.redhat.rhba:tst:20141977003"
          }
        ],
        "Criterias": [
          {
            "Operator": "OR",
            "Criterias": [
              {
                "Operator": "AND",
                "Criterions": [
                  {
                    "Comment": "docker is earlier than 0:1.9.1-40.el7",
                    "TestRef": "oval:com.redhat.rhsa:tst:20161034001"
                  },
                  {
                    "Comment": "docker is signed with Red Hat redhatrelease2 key",
                    "TestRef": "oval:com.redhat.rhba:tst:20141977002"
                  }
                ]
              },
              {
                "Operator": "AND",
                "Criterions": [
                  {
                    "Comment": "docker-common is earlier than 0:1.9.1-40.el7",
                    "TestRef": "oval:com.redhat.rhsa:tst:20161034003"
                  },
                  {
                    "Comment": "docker-common is signed with Red Hat redhatrelease2 key",
                    "TestRef": "oval:com.redhat.rhba:tst:20193092006"
                  }
                ]
              },
              {
                "Operator": "AND",
                "Criterions": [
                  {
                    "Comment": "docker-forward-journald is earlier than 0:1.9.1-40.el7",
                    "TestRef": "oval:com.redhat.rhsa:tst:20161034005"
                  },
                  {
                    "Comment": "docker-forward-journald is signed with Red Hat redhatrelease2 key",
                    "TestRef": "oval:com.redhat.rhsa:tst:20161034006"
                  }
                ]
              },
              {
                "Operator": "AND",
                "Criterions": [
                  {
                    "Comment": "docker-logrotate is earlier than 0:1.9.1-40.el7",
                    "TestRef": "oval:com.redhat.rhsa:tst:20161034007"
                  },
                  {
                    "Comment": "docker-logrotate is signed with Red Hat redhatrelease2 key",
                    "TestRef": "oval:com.redhat.rhba:tst:20151167006"
                  }
                ]
              },
              {
                "Operator": "AND",
                "Criterions": [
                  {
                    "Comment": "docker-selinux is earlier than 0:1.9.1-40.el7",
                    "TestRef": "oval:com.redhat.rhsa:tst:20161034009"
                  },
                  {
                    "Comment": "docker-selinux is signed with Red Hat redhatrelease2 key",
                    "TestRef": "oval:com.redhat.rhba:tst:20151167010"
                  }
                ]
              }
            ]
          }
        ]
      }
    ]
  }
}