{
  "Class": "patch",
  "ID": "oval:com.redhat.rhsa:def:20150535",
  "Version": "640",
  "Metadata": {
    "Title": "RHSA-2015:0535: GNOME Shell security, bug fix, and enhancement update (Low)",
    "AffectedList": [
      {
        "Family": "unix",
        "Platforms": [
          "Red Hat Enterprise Linux 7"
        ]
      }
    ],
    "References": [
      {
        "Source": "RHSA",
        "RefID": "RHSA-2015:0535",
        "RefURL": "https://access.redhat.com/errata/RHSA-2015:0535"
      },
      {
        "Source": "CVE",
        "RefID": "CVE-2014-7300",
        "RefURL": "https://access.redhat.com/security/cve/CVE-2014-7300"
      }
    ],
    "Description": "GNOME Shell and the packages it depends upon provide the core user interface of the Red Hat Enterprise Linux desktop, including functions such as navigating between windows and launching applications.\n\nIt was found that the GNOME shell did not disable the Print Screen key when the screen was locked. This could allow an attacker with physical access to a system with a locked screen to crash the screen-locking application by creating a large amount of screenshots. (CVE-2014-7300)\n\nThis update also fixes the following bugs:\n\n* The Timed Login feature, which automatically logs in a specified user after a specified period of time, stopped working after the first user of the GUI logged out. This has been fixed, and the specified user is always logged in if no one else logs in. (BZ#1043571)\n\n* If two monitors were arranged vertically with the secondary monitor above the primary monitor, it was impossible to move windows onto the secondary monitor. With this update, windows can be moved through the upper edge of the first monitor to the secondary monitor. (BZ#1075240)\n\n* If the Gnome Display Manager (GDM) user list was disabled and a user entered the user name, the password prompt did not appear. Instead, the user had to enter the user name one more time. The GDM code that contained this error has been fixed, and users can enter their user names and passwords as expected. (BZ#1109530)\n\n* Prior to this update, only a small area was available on the GDM login screen for a custom text banner. As a consequence, when a long banner was used, it did not fit into the area, and the person reading the banner had to use scrollbars to view the whole text. With this update, more space is used for the banner if necessary, which allows the user to read the message conveniently. (BZ#1110036)\n\n* When the Cancel button was pressed while an LDAP user name and password was being validated, the GDM code did not handle the situation correctly. As a consequence, GDM became unresponsive, and it was impossible to return to the login screen. The affected code has been fixed, and LDAP user validation can be canceled, allowing another user to log in instead. (BZ#1137041)\n\n* If the window focus mode in GNOME was set to \"mouse\" or \"sloppy\", navigating through areas of a pop-up menu displayed outside its parent window caused the window to lose its focus. Consequently, the menu was not usable. This has been fixed, and the window focus is kept in under this scenario. (BZ#1149585)\n\n* If user authentication is configured to require a smart card to log in, user names are obtained from the smart card. The authentication is then performed by entering the smart card PIN. Prior to this update, the login screen allowed a user name to be entered if no smart card was inserted, but due to a bug in the underlying code, the screen became unresponsive. If, on the other hand, a smart card was used for authentication, the user was logged in as soon as the authentication was complete. As a consequence, it was impossible to select a session other than GNOME Classic. Both of these problems have been fixed. Now, a smart card is required when this type of authentication is enabled, and any other installed session can be selected by the user. (BZ#1159385, BZ#1163474)\n\nIn addition, this update adds the following enhancement:\n\n* Support for quad-buffer OpenGL stereo visuals has been added. As a result, OpenGL applications that use quad-buffer stereo can be run and properly displayed within the GNOME desktop when used with a video driver and hardware with the necessary capabilities. (BZ#861507, BZ#1108890, BZ#1108891, BZ#1108893)\n\nAll GNOME Shell users are advised to upgrade to these updated packages, which contain backported patches to correct these issues and add this enhancement.",
    "Advisory": {
      "From": "secalert@redhat.com",
      "Severity": "Low",
      "Rights": "Copyright 2015 Red Hat, Inc.",
      "Issued": {
        "Date": "2015-03-05"
      },
      "Updated": {
        "Date": "2015-03-05"
      },
      "Cves": [
        {
          "CveID": "CVE-2014-7300",
          "Cvss2": "3.6/AV:L/AC:L/Au:N/C:P/I:N/A:P",
          "Cwe": "CWE-285-\u003eCWE-770-\u003eCWE-305",
          "Impact": "low",
          "Href": "https://access.redhat.com/security/cve/CVE-2014-7300",
          "Public": "20140927"
        }
      ],
      "Bugzilla": [
        {
          "Href": "https://bugzilla.redhat.com/1147917",
          "ID": "1147917"
        }
      ],
      "AffectedCpeList": [
        "cpe:/a:redhat:rhel_extras_sap_eus:7.7",
        "cpe:/a:redhat:rhel_extras_sap_hana_eus:7.7",
        "cpe:/o:redhat:rhel_eus:7.7",
        "cpe:/o:redhat:rhel_eus:7.7::computenode",
        "cpe:/o:redhat:rhel_eus:7.7::server"
      ],
      "Affected": {
        "Resolution": {}
      }
    }
  },
  "Criteria": {
    "Operator": "OR",
    "Criterions": [
      {
        "Comment": "Red Hat Enterprise Linux must be installed",
        "TestRef": "oval:com.redhat.rhba:tst:20150364028"
      }
    ],
    "Criterias": [
      {
        "Operator": "AND",
        "Criterions": [
          {
            "Comment": "Red Hat Enterprise Linux 7 is installed",
            "TestRef": "oval:com.redhat.rhba:tst:20150364027"
          }
        ],
        "Criterias": [
          {
            "Operator": "OR",
            "Criterias": [
              {
                "Operator": "AND",
                "Criterions": [
                  {
                    "Comment": "cogl is earlier than 0:1.14.0-6.el7",
                    "TestRef": "oval:com.redhat.rhsa:tst:20150535001"
                  },
                  {
                    "Comment": "cogl is signed with Red Hat redhatrelease2 key",
                    "TestRef": "oval:com.redhat.rhsa:tst:20150535002"
                  }
                ]
              },
              {
                "Operator": "AND",
                "Criterions": [
                  {
                    "Comment": "cogl-devel is earlier than 0:1.14.0-6.el7",
                    "TestRef": "oval:com.redhat.rhsa:tst:20150535003"
                  },
                  {
                    "Comment": "cogl-devel is signed with Red Hat redhatrelease2 key",
                    "TestRef": "oval:com.redhat.rhsa:tst:20150535004"
                  }
                ]
              },
              {
                "Operator": "AND",
                "Criterions": [
                  {
                    "Comment": "cogl-doc is earlier than 0:1.14.0-6.el7",
                    "TestRef": "oval:com.redhat.rhsa:tst:20150535005"
                  },
                  {
                    "Comment": "cogl-doc is signed with Red Hat redhatrelease2 key",
                    "TestRef": "oval:com.redhat.rhsa:tst:20150535006"
                  }
                ]
              },
              {
                "Operator": "AND",
                "Criterions": [
                  {
                    "Comment": "clutter is earlier than 0:1.14.4-12.el7",
                    "TestRef": "oval:com.redhat.rhsa:tst:20150535007"
                  },
                  {
                    "Comment": "clutter is signed with Red Hat redhatrelease2 key",
                    "TestRef": "oval:com.redhat.rhsa:tst:20150535008"
                  }
                ]
              },
              {
                "Operator": "AND",
                "Criterions": [
                  {
                    "Comment": "clutter-devel is earlier than 0:1.14.4-12.el7",
                    "TestRef": "oval:com.redhat.rhsa:tst:20150535009"
                  },
                  {
                    "Comment": "clutter-devel is signed with Red Hat redhatrelease2 key",
                    "TestRef": "oval:com.redhat.rhsa:tst:20150535010"
                  }
                ]
              },
              {
                "Operator": "AND",
                "Criterions": [
                  {
                    "Comment": "clutter-doc is earlier than 0:1.14.4-12.el7",
                    "TestRef": "oval:com.redhat.rhsa:tst:20150535011"
                  },
                  {
                    "Comment": "clutter-doc is signed with Red Hat redhatrelease2 key",
                    "TestRef": "oval:com.redhat.rhsa:tst:20150535012"
                  }
                ]
              },
              {
                "Operator": "AND",
                "Criterions": [
                  {
                    "Comment": "gnome-shell is earlier than 0:3.8.4-45.el7",
                    "TestRef": "oval:com.redhat.rhsa:tst:20150535013"
                  },
                  {
                    "Comment": "gnome-shell is signed with Red Hat redhatrelease2 key",
                    "TestRef": "oval:com.redhat.rhba:tst:20192044170"
                  }
                ]
              },
              {
                "Operator": "AND",
                "Criterions": [
                  {
                    "Comment": "gnome-shell-browser-plugin is earlier than 0:3.8.4-45.el7",
                    "TestRef": "oval:com.redhat.rhsa:tst:20150535015"
                  },
                  {
                    "Comment": "gnome-shell-browser-plugin is signed with Red Hat redhatrelease2 key",
                    "TestRef": "oval:com.redhat.rhsa:tst:20150535016"
                  }
                ]
              },
              {
                "Operator": "AND",
                "Criterions": [
                  {
                    "Comment": "mutter is earlier than 0:3.8.4-16.el7",
                    "TestRef": "oval:com.redhat.rhsa:tst:20150535017"
                  },
                  {
                    "Comment": "mutter is signed with Red Hat redhatrelease2 key",
                    "TestRef": "oval:com.redhat.rhba:tst:20192044106"
                  }
                ]
              },
              {
                "Operator": "AND",
                "Criterions": [
                  {
                    "Comment": "mutter-devel is earlier than 0:3.8.4-16.el7",
                    "TestRef": "oval:com.redhat.rhsa:tst:20150535019"
                  },
                  {
                    "Comment": "mutter-devel is signed with Red Hat redhatrelease2 key",
                    "TestRef": "oval:com.redhat.rhba:tst:20192044108"
                  }
                ]
              }
            ]
          }
        ]
      }
    ]
  }
}