{
  "Class": "patch",
  "ID": "oval:com.redhat.rhsa:def:20111635",
  "Version": "649",
  "Metadata": {
    "Title": "RHSA-2011:1635: cups security and bug fix update (Low)",
    "AffectedList": [
      {
        "Family": "unix",
        "Platforms": [
          "Red Hat Enterprise Linux 6"
        ]
      }
    ],
    "References": [
      {
        "Source": "RHSA",
        "RefID": "RHSA-2011:1635",
        "RefURL": "https://access.redhat.com/errata/RHSA-2011:1635"
      },
      {
        "Source": "CVE",
        "RefID": "CVE-2011-2896",
        "RefURL": "https://access.redhat.com/security/cve/CVE-2011-2896"
      }
    ],
    "Description": "The Common UNIX Printing System (CUPS) provides a portable printing layer\nfor UNIX operating systems.\n\nA heap-based buffer overflow flaw was found in the Lempel-Ziv-Welch (LZW)\ndecompression algorithm implementation used by the CUPS GIF image format\nreader. An attacker could create a malicious GIF image file that, when\nprinted, could possibly cause CUPS to crash or, potentially, execute\narbitrary code with the privileges of the \"lp\" user. (CVE-2011-2896)\n\nThese updated cups packages also provide fixes for the following bugs:\n\n* Previously CUPS was not correctly handling the language setting\nLANG=en_US.ASCII. As a consequence lpadmin, lpstat and lpinfo binaries were\nnot displaying any output when the LANG=en_US.ASCII environment variable\nwas used. As a result of this update the problem is fixed and the expected\noutput is now displayed. (BZ#681836)\n\n* Previously the scheduler did not check for empty values of several\nconfiguration directives. As a consequence it was possible for the CUPS\ndaemon (cupsd) to crash when a configuration file contained certain empty\nvalues. With this update the problem is fixed and cupsd no longer crashes\nwhen reading such a configuration file. (BZ#706673)\n\n* Previously when printing to a raw print queue, when using certain printer\nmodels, CUPS was incorrectly sending SNMP queries. As a consequence there\nwas a noticeable 4-second delay between queueing the job and the start of\nprinting. With this update the problem is fixed and CUPS no longer tries to\ncollect SNMP supply and status information for raw print queues.\n(BZ#709896)\n\n* Previously when using the BrowsePoll directive it could happen that the\nCUPS printer polling daemon (cups-polld) began polling before the network\ninterfaces were set up after a system boot. CUPS was then caching the\nfailed hostname lookup. As a consequence no printers were found and the\nerror, \"Host name lookup failure\", was logged. With this update the code\nthat re-initializes the resolver after failure in cups-polld is fixed and\nas a result CUPS will obtain the correct network settings to use in printer\ndiscovery. (BZ#712430)\n\n* The MaxJobs directive controls the maximum number of print jobs that are\nkept in memory. Previously, once the number of jobs reached the limit, the\nCUPS system failed to automatically purge the data file associated with the\noldest completed job from the system in order to make room for a new print\njob. This bug has been fixed, and the jobs beyond the set limit are now\nproperly purged. (BZ#735505)\n\n* The cups init script (/etc/rc.d/init.d/cups) uses the daemon function\n(from /etc/rc.d/init.d/functions) to start the cups process, but previously\nit did not source a configuration file from the /etc/sysconfig/ directory.\nAs a consequence, it was difficult to cleanly set the nice level or cgroup\nfor the cups daemon by setting the NICELEVEL or CGROUP_DAEMON variables.\nWith this update, the init script is fixed. (BZ#744791)\n\nAll users of CUPS are advised to upgrade to these updated packages, which\ncontain backported patches to resolve these issues. After installing this\nupdate, the cupsd daemon will be restarted automatically.",
    "Advisory": {
      "From": "secalert@redhat.com",
      "Severity": "Low",
      "Rights": "Copyright 2011 Red Hat, Inc.",
      "Issued": {
        "Date": "2011-12-05"
      },
      "Updated": {
        "Date": "2011-12-06"
      },
      "Cves": [
        {
          "CveID": "CVE-2011-2896",
          "Cvss2": "5.1/AV:N/AC:H/Au:N/C:P/I:P/A:P",
          "Impact": "low",
          "Href": "https://access.redhat.com/security/cve/CVE-2011-2896",
          "Public": "20110810"
        }
      ],
      "Bugzilla": [
        {
          "Href": "https://bugzilla.redhat.com/727800",
          "ID": "727800"
        }
      ],
      "AffectedCpeList": [
        "cpe:/o:redhat:rhel_eus:6.1"
      ],
      "Affected": {
        "Resolution": {}
      }
    }
  },
  "Criteria": {
    "Operator": "OR",
    "Criterions": [
      {
        "Comment": "Red Hat Enterprise Linux must be installed",
        "TestRef": "oval:com.redhat.rhba:tst:20111656004"
      }
    ],
    "Criterias": [
      {
        "Operator": "AND",
        "Criterions": [
          {
            "Comment": "Red Hat Enterprise Linux 6 is installed",
            "TestRef": "oval:com.redhat.rhba:tst:20111656003"
          }
        ],
        "Criterias": [
          {
            "Operator": "OR",
            "Criterias": [
              {
                "Operator": "AND",
                "Criterions": [
                  {
                    "Comment": "cups is earlier than 1:1.4.2-44.el6",
                    "TestRef": "oval:com.redhat.rhsa:tst:20111635001"
                  },
                  {
                    "Comment": "cups is signed with Red Hat redhatrelease2 key",
                    "TestRef": "oval:com.redhat.rhsa:tst:20100866002"
                  }
                ]
              },
              {
                "Operator": "AND",
                "Criterions": [
                  {
                    "Comment": "cups-devel is earlier than 1:1.4.2-44.el6",
                    "TestRef": "oval:com.redhat.rhsa:tst:20111635003"
                  },
                  {
                    "Comment": "cups-devel is signed with Red Hat redhatrelease2 key",
                    "TestRef": "oval:com.redhat.rhsa:tst:20100866004"
                  }
                ]
              },
              {
                "Operator": "AND",
                "Criterions": [
                  {
                    "Comment": "cups-libs is earlier than 1:1.4.2-44.el6",
                    "TestRef": "oval:com.redhat.rhsa:tst:20111635005"
                  },
                  {
                    "Comment": "cups-libs is signed with Red Hat redhatrelease2 key",
                    "TestRef": "oval:com.redhat.rhsa:tst:20100866006"
                  }
                ]
              },
              {
                "Operator": "AND",
                "Criterions": [
                  {
                    "Comment": "cups-lpd is earlier than 1:1.4.2-44.el6",
                    "TestRef": "oval:com.redhat.rhsa:tst:20111635007"
                  },
                  {
                    "Comment": "cups-lpd is signed with Red Hat redhatrelease2 key",
                    "TestRef": "oval:com.redhat.rhsa:tst:20100866008"
                  }
                ]
              },
              {
                "Operator": "AND",
                "Criterions": [
                  {
                    "Comment": "cups-php is earlier than 1:1.4.2-44.el6",
                    "TestRef": "oval:com.redhat.rhsa:tst:20111635009"
                  },
                  {
                    "Comment": "cups-php is signed with Red Hat redhatrelease2 key",
                    "TestRef": "oval:com.redhat.rhsa:tst:20100866010"
                  }
                ]
              }
            ]
          }
        ]
      }
    ]
  }
}